app/controllers/students_controller.rb

  def create
    @student = Student.create(params[:student])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-01-02 05:18:02.485819"], ["updated_at", "2017-01-02 05:18:02.485819"]]

  def update
    @student = Student.find(params[:id])
    @student.update(params[:student])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-01-02 05:16:26.400471"], ["id", 1]]